""" Напишіть програму, яка буде виконувати найпростіші математичні операції з числами послідовно, 
приймаючи від користувача операнди (числа) та оператор.

Умови для цієї задачі

Додаток працює з цілими та дійсними числами.
Додаток вміє виконувати такі математичні операції:
ДОДАВАННЯ (+)
ВІДНІМАННЯ(-)
МНОЖЕННЯ (*)
ДІЛЕННЯ (/)
Програма приймає один операнд або один оператор за один цикл запит-відповідь.
Всі операції програма виконує в порядку надходження — одну за одною.
Програма виводить результат обчислень, коли отримує від користувача символ =.
Додаток закінчує роботу після того, як виведе результат обчислення.
Користувач по черзі вводить числа та оператори.
Якщо користувач вводить оператор двічі поспіль, він отримує повідомлення про помилку і може ввести повторно.
Якщо користувач вводить число двічі поспіль, він отримує повідомлення про помилку і може ввести повторно.
Додаток коректно опрацьовує ситуацію некоректного введення (exception).
Перша: ["10", "+", "5", "6", "/", "3", "-", "/", "2", "*", "6", "= "], результат 18.0
Друга: ["2", "3", "-", "1", "+", "10", "*", "2", "="], результат 22.0
"""



result = None # будемо записувати резуьтат обчислення 1 + 3 = 4
operand = None # будемо записувати число, яке ввели
operator = None # ... +, -, *, /
wait_for_number = True # флаг чекаємо коли введуть число

while True:
    user_input = input('>>> ')
    if wait_for_number is True:
        # тут логіка обробки числа
        print('Я в гілці обрабки числа')
        try:
           operand = float(user_input) 
        except ValueError: 
            print('Це не число, спробуй ще раз')
            continue    
        
        if result is None:
            result = operand
        
        if operator == '+':
            result += operand
        elif operator == '-':
            result -= operand  
        elif operator == '*':
            result *= operand
        elif operator == '/':
            try:
                result /= operand
            except ZeroDivisionError:
                print('На нуль ділити не можно. Спробуй ще раз')
                continue
        wait_for_number = False
    else:
        # логіка обрабки оператора
        print('Я в гілці обрабки оператора')
        if user_input not in ('+', '-', '*', '/', '='):
            print('Це не оператор, спробуй ще')
            continue
        else:
            operator = user_input
            if operator == '=':
                print(result)
                break 
        wait_for_number = True
